
// // --- Задача 1 -------------------------------------------
// // Дано ширину екрана та кількість елементів, 
// // які повинні бути відображені у рядку. 
// // Визначити ширину елементів, які повинні 
// // бути відображені у цьому рядку.

// // Введення
// let widthScreen = parseFloat(prompt("Ширина екрана", "0"))
// let numberElements = parseFloat(prompt("кількість елементів", "0"))

// // Обчислення
// let widthElements = widthScreen / numberElements

// // Виведення
// console.log(`Ширина елементів = ${widthElements}`);


// // --- Задача 2 -------------------------------------------
// // З клавіатури вводиться розмір заробітної плати та розмір 
// // прожиткового мінімуму. Визначити розмір соціальної 
// // допомоги (ввжаємо, що заробітна плата є меншою).

// // Введення
// let sizeSalary = parseFloat(prompt("розмір заробітної плати"))
// let sizeLivelihood = parseFloat(prompt("розмір прожиткового мінімуму"))

// // Обчислення
// let sizeSocialHelp = sizeLivelihood - sizeSalary

// // Виведення
// console.log(`Розмір соціальної допомоги = ${sizeSocialHelp}`);
